<?php
header("Content-type: text/html; charset=utf-8");

// Задание 1.
$i = 0;
while ($i <= 100) {
  if ($i % 3 == 0) {
    echo $i . " ";
  }
  $i++;
}

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 2.
$i = 0;
do {
  if ($i == 0) {
    echo $i . " - это ноль.<br>";
  } elseif ($i % 2 == 0) {
    echo $i . " - четное число.<br>";
  } else {
    echo $i . " - нечетное число.<br>";
  }
  $i++;
} while ($i <= 10);

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 3.
$arrRegion = [
  "Московская область" => [
    "Москва",
    "Балашиха",
    "Домодедово",
    "Жуковский",
    "Клин",
    "Коломна",
  ],
  "Ленинградская область" => [
    "Санкт-Петербург",
    "Всеволожск",
    "Павловск",
    "Кронштадт",
    "Кингисепп",
    "Шлиссельбург",
  ],
  "Самарская область" => [
    "Самара",
    "Новокуйбышевск",
    "Сызрань",
    "Тольятти",
    "Кинель",
    "Чапаевск",
  ],
];

foreach ($arrRegion as $key => $value) {
  echo $key . "<br>";
  for ($i = 0; $i < count($value); $i++) {
    echo "&nbsp;&nbsp;&nbsp;&nbsp; {$value[$i]} <br>";
  }
}

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 4.
/**
 * Функция выполняет транслитерацию строк с кирилицы на латиницу.
 * @param string $st - Исходная строка.
 * @return string Возвращается преобразованная строка.
 */
function transliterate($st) {
  $pattern = ['а', 'б', 'в', 'г', 'д', 'е', 'ё',
    'ж', 'з', 'и', 'й', 'к', 'л', 'м',
    'н', 'о', 'п', 'р', 'с', 'т', 'у',
    'ф', 'х', 'ч', 'ц', 'ш', 'щ', 'ъ',
    'ы', 'ь', 'э', 'ю', 'я',
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё',
    'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М',
    'Н', 'О', 'П', 'Р', 'С', 'Т', 'У',
    'Ф', 'Х', 'Ч', 'Ц', 'Ш', 'Щ', 'Ъ',
    'Ы', 'Ь', 'Э', 'Ю', 'Я'];
  $replace = ['a', 'b', 'v', 'g', 'd', 'e', 'yo',
    'zh', 'z', 'i', 'y', 'k', 'l', 'm',
    'n', 'o', 'p', 'r', 's', 't', 'u',
    'f', 'h', 'ch', 'ts', 'sh', 'sch', '',
    'y', '', 'e', 'yu', 'ya',
    'A', 'B', 'V', 'G', 'D', 'E', 'Yo',
    'Zh', 'Z', 'I', 'Y', 'K', 'L', 'M',
    'N', 'O', 'P', 'R', 'S', 'T', 'U',
    'F', 'H', 'CH', 'Ts', 'Sh', 'Sch', '',
    'Y', '', 'E', 'Yu', 'Ya'];
  return str_replace($pattern, $replace, $st);
}

$st = "Функция выполняет транслитерацию строк с кирилицы на латиницу.";
echo transliterate($st);

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 5.
/**
 * Функция заменяет в строке пробелы на подчеркивания.
 * @param string $st - Исхоная строка.
 * @return string Возвращается преобразованная строка.
 */
function replaceSpaceToUnderline($st) {
  return str_replace(" ", "_", $st);
}

$st = "Функция заменяет в строке пробелы на подчеркивания.";
echo replaceSpaceToUnderline($st);

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 6. Эмуляция двухуровневой навигации.
$navigation = [
  "О компании" => [
    "Наша миссия",
    "Сотрудники",
    "Партнеры",
  ],
  "Продукция" => [
    "Строительные материалы",
    "Оборудование",
    "Аксессуары",
  ],
  "Услуги" => [
    "Продажа",
    "Доставка",
    "Установка",
  ],
  "Наши координаты" => [],
];

foreach ($navigation as $key => $value) {
  echo "<div style='font-weight: bold;'>" . $key . "</div>";
  echo "<ul>";
  for ($i = 0; $i < count($value); $i++) {
    echo "<li>{$value[$i]} </li>";
  }
  echo "</ul>";
}

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 7.
for ($i = 0; $i < 10; print $i . " ", $i++) {
  // здесь пусто
}

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 8.
// Массив из регионов и городов береться из задания 3.
foreach ($arrRegion as $key => $value) {
  echo $key . "<br>";
  for ($i = 0; $i < count($value); $i++) {
    if (mb_eregi("^к", $value[$i])) {
      echo "&nbsp;&nbsp;&nbsp;&nbsp; {$value[$i]} <br>";
    }
  }
}

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 9.
/**
 * Функция переводит сроку в латиницу и заменяет пробелы подчеркиванием.
 * @param string $value - Заданная строка.
 * @return string Возврщает преобразованную строку.
 */
function LatinAndUnderline($value) {
  // убираем пробелы вначали и в конце строки
  $value = trim($value);
  // выполняем транслитерацию (функция описана ранее)
  $value = transliterate($value);
  // переводим в нижний регистр
  $value = mb_strtolower($value);
  // заменяем пробелы на подчеркивание.
  $value = str_replace(" ", "_", $value);
  return $value;
}

$string = "Функция переводит сроку в латиницу и заменяет пробелы подчеркиванием.";
echo LatinAndUnderline($string);

echo "<br><br>-------------------------------------------------------------<br><br>";

// Задание 9 можно усовершенствовать и написать настоящую функцию которая переводи строку в человекочитаемый url.
/**
 * Функция переводит заданную строку в человекочитаемый url. Если написано неправильно, то приводится в правильный вид.
 * @param string $value - Заданная строка.
 * @return string Возврщает преобразованную строку.
 */
function urlFromString($value) {
  // убираем пробелы вначали и в конце строки
  $value = trim($value);
  // выполняем транслитерацию (функция описана ранее)
  $value = transliterate($value);
  // переводим в нижний регистр
  $value = mb_strtolower($value);
  // удаляем все символы за исключением a-z, 0-9, тире, подчеркиваний и пробелов
  $value = preg_replace('#[^-a-z0-9_ ]#', '', $value);
  // замена пробелов, дефисов и тире на один дефис
  $value = preg_replace('#[-_ ]+#', '-', $value);
  return $value;
}

$string = "Функция переводит заданную строку в человекочитаемый url.";
echo urlFromString($string);